In [1]:
import pandas as pd

alunos = {'Nome': ['Ricardo', 'Pedro', 'Roberto'],
          'Nota': [4, 7, 8],
          'Aprovado':['Não', 'Sim', 'Sim']}

In [17]:
alunosDF = pd.DataFrame(alunos)

alunosDF

      Nome  Nota Aprovado
0  Ricardo     4      Não
1    Pedro     7      Sim
2  Roberto     8      Sim

In [6]:
alunosDF['Aprovado']

0    Não
1    Sim
2    Sim
Name: Aprovado, dtype: object

In [7]:
alunosDF.describe()

           Nota
count  3.000000
mean   6.333333
std    2.081666
min    4.000000
25%    5.500000
50%    7.000000
75%    7.500000
max    8.000000

In [9]:
alunosDF.shape

(3, 3)

In [13]:
alunosDF.loc[0]

Nome        Ricardo
Nota              4
Aprovado        Não
Name: 0, dtype: object

In [14]:
alunosDF.loc[1:3]

      Nome  Nota Aprovado
1    Pedro     7      Sim
2  Roberto     8      Sim

In [15]:
alunosDF.loc[alunosDF['Nome'] == 'Pedro']

    Nome  Nota Aprovado
1  Pedro     7      Sim

In [18]:
alunosDF.loc[alunosDF['Aprovado'] == 'Não']

      Nome  Nota Aprovado
0  Ricardo     4      Não